robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_ems001.c
// //   /*!< Configure sEE_I2C pins: SDA */
// //   GPIO_InitStructure.GPIO_Pin = HAL_BRDCFG_I2C4HAL__I2C_SDA_PIN;
// //   GPIO_Init(HAL_BRDCFG_I2C4HAL__I2C_SDA_GPIO_PORT, &GPIO_InitStructure);
// // }


#endif//HAL_USE_I2C4HAL


#ifdef HAL_USE_I2C4HAL

// extern void hal_brdcfg_i2c4hal__LowLevel_Init(void)
// {
//   GPIO_InitTypeDef  GPIO_InitStructure;
//   uint8_t count = 0;
//   
//   /* This sequence is strongly recommended after each board reset.
//      This is necessary because I2C bus standard doesn't provide signal to 
//      inizialize communication, so there is the possibility that some device
//      connect to the bus don't start properly after system reset.
//      (See EMS001 Refernce Manual chapter 6.) 
//     */
//   RCC->APB2ENR |= 0x00000008; //enable clock on port B
//   
//   //step 1
//   GPIOB->CRH &= 0xFFFFFF00;//Reset Pin 8 and 9.
//   GPIOB->CRH |= 0x000000DD; //Configure pin 8 and 9 as General Purpose output Open Drain 50Mhz

//   GPIOB->BSRR |= 0x00000300; // Set Pin 8 and 9 HIGH
//   
//   //step 2 and 3
//   while( (!(GPIOB->ODR & 0x200)) && (count < 9))//finche' non e' settato il pin 9
//   {
//     //pulse PB8   (al max posso farlo per 9 volte)
//     GPIOB->BRR |= 0x00000100;  // PB8LOW
//     //wait 2 microsec at least TODO: Verify
//     s_hal_ems001_i2c_wait2micro();

//     GPIOB->BSRR |= 0x00000100;  // PB8 HIGH
//     //wait 2 microsec at least
//     s_hal_ems001_i2c_wait2micro();

//     count++;
//   }
//   if(9 == count)
//   {
//     return; //error
//   } 

//   //step 4: perform start condition
//   GPIOB->BSRR |= 0x00000100; //Pin B8 HIGH
//   GPIOB->BRR  |= 0x00000200;  //Pin B9 LOW 
//   GPIOB->BRR  |= 0x00000100;  //Pin B8 LOW 

//   //step 5
//   GPIOB->BSRR |= 0x00000100; //Pin B9 HIGH

//   //step 6 ==> //pulse pin 8 for 9 times
//   for(count = 0; count < 9; count ++)
//   {
//     
//     GPIOB->BSRR |= 0x00000100;  // PB8 HIGH
//     //wait 2 microsec at least
//     s_hal_ems001_i2c_wait2micro();

//     //pulse PB8   (al max posso farlo per 9 volte)
//     GPIOB->BRR |= 0x00000100;  // PB8LOW
//     //wait 2 microsec at least TODO: Verify
//     s_hal_ems001_i2c_wait2micro();

//   }
//   
//   //step 7 perform start condition
//   GPIOB->BSRR |= 0x00000100; //Pin B8 HIGH
//   GPIOB->BRR  |= 0x00000200;  //Pin B9 LOW 
//   GPIOB->BRR  |= 0x00000100;  //Pin B8 LOW

//   //step 8 perform stop condition
//   GPIOB->BSRR |= 0x00000200; // Set Pin 8 HIGH
//   GPIOB->BSRR |= 0x00000100; // Set Pin 9 HIGH



//   /*!< sEE_I2C_SCL_GPIO_CLK and sEE_I2C_SDA_GPIO_CLK Periph clock enable */
//   RCC_APB2PeriphClockCmd(HAL_BRDCFG_I2C4HAL__I2C_SCL_GPIO_CLK | HAL_BRDCFG_I2C4HAL__I2C_SDA_GPIO_CLK, ENABLE);

//   /*!< sEE_I2C Periph clock enable */
//   RCC_APB1PeriphClockCmd(HAL_BRDCFG_I2C4HAL__I2C_CLK, ENABLE);

//   AFIO->MAPR |= AFIO_MAPR_I2C1_REMAP;  /* I2C1 remapping */
//     
//   /*!< GPIO configuration */  
//   /*!< Configure sEE_I2C pins: SCL */
//   GPIO_InitStructure.GPIO_Pin = HAL_BRDCFG_I2C4HAL__I2C_SCL_PIN;
//   GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//   GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
//   GPIO_Init(HAL_BRDCFG_I2C4HAL__I2C_SCL_GPIO_PORT, &GPIO_InitStructure);

//   /*!< Configure sEE_I2C pins: SDA */
//   GPIO_InitStructure.GPIO_Pin = HAL_BRDCFG_I2C4HAL__I2C_SDA_PIN;
//   GPIO_Init(HAL_BRDCFG_I2C4HAL__I2C_SDA_GPIO_PORT, &GPIO_InitStructure);

// // acemor moved in anotehr function
// //  //configure pin B10 for eeprom write protect 
// //  GPIOB->CRH &= 0xFFFFF0FF;//Reset Pin 10.
// //  GPIOB->CRH |= 0x00000200; //Configure pin 10 as General Purpose output Push Pull 2Mhz
// //  GPIOB->BSRR |= 0x0400;  //disable write on eeprom
// }

#endif//HAL_USE_I2C4HAL


#ifdef HAL_USE_EEPROM

extern void hal_brdcfg_eeprom__ontimeouterror(void)
{
    hal_base_hid_on_fatalerror(hal_fatalerror_runtimefault, "timeout in eeprom");
}


#endif//HAL_USE_EEPROM




#ifdef HAL_USE_SPI4ENCODER

/*Note: if there will be some speed problem try to transform  hal_brdcfg_spi4encoder__encoder_enable and  hal_brdcfg_spi4encoder__encoder_disable as inline function,
but pay attention with the project with scatter file.probably it will give you trouble*/

extern void  hal_brdcfg_spi4encoder__encoder_enable(hal_spi_port_t spix,  hal_spi_mux_t e)
{
    HAL_BRDCFG_SPI4ENCODER__SPI_CS_SEL(spix, e);
    HAL_BRDCFG_SPI4ENCODER__SPI_CS_ENA(spix);	
}

extern void  hal_brdcfg_spi4encoder__encoder_disable(hal_spi_port_t spix,  hal_spi_mux_t e)
{
    HAL_BRDCFG_SPI4ENCODER__SPI_CS_DESEL(spix);
    HAL_BRDCFG_SPI4ENCODER__SPI_CS_DISA(spix);	
}

void  hal_brdcfg_spi4encoder__chipSelect_init(hal_spi_port_t spix)
{
	GPIO_InitTypeDef  GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; //output push-pull mode
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;

//1) init data struct and GPIO regiter
	switch(spix)
	{
		case hal_spi_port1:
		{
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[0].BRR_reg = SPI1_GPIO_SEL_LOW_ENCODER_0; //pin che devono valere zero
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[0].BSRR_reg = SPI1_GPIO_SEL_HIGH_ENCODER_0;	//pin che devono valere 1
    
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[1].BRR_reg = SPI1_GPIO_SEL_LOW_ENCODER_1;
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[1].BSRR_reg = SPI1_GPIO_SEL_HIGH_ENCODER_1;
    
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[2].BRR_reg = SPI1_GPIO_SEL_LOW_ENCODER_2;
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[2].BSRR_reg = SPI1_GPIO_SEL_HIGH_ENCODER_2;
    
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_pin_ena_slave = SPI1_GPIO_ENA_SLAVE;
    		hal_SPI4ENCODER_ENCDATA_GET(spix).encoder_gpio_port = HAL_BRDCFG_SPI4ENCODER__SPI1_GPIO_PORT_CS;	
    
    		GPIO_InitStructure.GPIO_Pin = SPI1_GPIO_SEL_ENCODER_PIN_1| SPI1_GPIO_SEL_ENCODER_PIN_2 | SPI1_GPIO_ENA_SLAVE; //tutti i pin sono sulla stessa porta.
    		GPIO_Init(HAL_BRDCFG_SPI4ENCODER__SPI1_GPIO_PORT_CS, &GPIO_InitStructure);
		
		} break;
		
		case hal_spi_port3:
		{
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[0].BRR_reg = SPI3_GPIO_SEL_LOW_ENCODER_0; //pin che devono valere zero
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[0].BSRR_reg = SPI3_GPIO_SEL_HIGH_ENCODER_0;	//pin che devono valere 1
    
