robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/brdcfg/hal_brdcfg_ems001.c
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[1].BRR_reg = SPI3_GPIO_SEL_LOW_ENCODER_1;
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[1].BSRR_reg = SPI3_GPIO_SEL_HIGH_ENCODER_1;
    
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[2].BRR_reg = SPI3_GPIO_SEL_LOW_ENCODER_2;
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_encoder[2].BSRR_reg = SPI3_GPIO_SEL_HIGH_ENCODER_2;
    
    		hal_SPI4ENCODER_ENCDATA_GET(spix).cs_pin_ena_slave = SPI3_GPIO_ENA_SLAVE;
    		hal_SPI4ENCODER_ENCDATA_GET(spix).encoder_gpio_port = HAL_BRDCFG_SPI4ENCODER__SPI3_GPIO_PORT_CS;	
    
    		GPIO_InitStructure.GPIO_Pin = SPI3_GPIO_SEL_ENCODER_PIN_1| SPI3_GPIO_SEL_ENCODER_PIN_2 | SPI3_GPIO_ENA_SLAVE; //tutti i pin sono sulla stessa porta.
    		GPIO_Init(HAL_BRDCFG_SPI4ENCODER__SPI3_GPIO_PORT_CS, &GPIO_InitStructure);
		
		} break;

	}


//3) set pin high value
	HAL_BRDCFG_SPI4ENCODER__SPI_CS_DESEL(spix);
	HAL_BRDCFG_SPI4ENCODER__SPI_CS_DISA(spix);
	
//4)  enable powe supply
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE); 
	GPIOE->CRL &= 0xFFFFFF0F;  //reset Pin 1
	GPIOE->CRL |= 0x00000020;  //Configure pin 1 as General Purpose output Push Pull 2Mhz 
	GPIOE->BSRR |= 0x0002; //enable power supply
}

#endif//HAL_USE_SPI4ENCODER

                     
#ifdef HAL_USE_SWITCH
 
//extern  void hal_brdcfg_switch__MCO_config(void)
//{
//
////  GPIO_InitTypeDef  GPIO_InitStructure;
////  
////  
////  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
////  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
////  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
////  GPIO_Init(GPIOA, &GPIO_InitStructure);
////
////  /* set PLL3 clock output to 50MHz (25MHz /5 *10 =50MHz) */
////  RCC_PLL3Config(RCC_PLL3Mul_10);
////  /* Enable PLL3 */
////  RCC_PLL3Cmd(ENABLE);
////  /* Wait till PLL3 is ready */
////  while (RCC_GetFlagStatus(RCC_FLAG_PLL3RDY) == RESET)
////  {}
////
////  /* Get clock PLL3 clock on PA8 pin */
////  RCC_MCOConfig(RCC_MCO_PLL3CLK);
//	
// // GPIO_InitTypeDef  GPIO_InitStructure;
//  uint32_t tmpreg = 0;
//  
////  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
////  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
////  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
////  GPIO_Init(GPIOA, &GPIO_InitStructure);
//
//// il clock sulla porta A e' abilitato all'inizio nella eth init.
//  	GPIOA->CRH   &= 0xFFFFFFF0;
//	GPIOA->CRH   |= 0x0000000B;	/*Pin 8 is congigured in AlterFunc 50MHz*/	
//
//  /* set PLL3 clock output to 50MHz (25MHz /5 *10 =50MHz) */
// // RCC_PLL3Config(RCC_PLL3Mul_10);
//#define CFGR2_PLL3MUL                   ((uint32_t)0x0000F000)
//#define  RCC_PLL3Mul_10                 ((uint32_t)0x00008000)  
//  tmpreg = RCC->CFGR2;
//  /* Clear PLL3Mul[3:0] bits */
//  tmpreg &= ~CFGR2_PLL3MUL;
//  /* Set the PLL3 configuration bits */
//  tmpreg |= RCC_PLL3Mul_10;
//  /* Store the new value */
//  RCC->CFGR2 = tmpreg;
//
//
//
//  /* Enable PLL3 */
//  //RCC_PLL3Cmd(ENABLE);
//  RCC->CR |=0x10000000;
//  /* Wait till PLL3 is ready */
//  while (RCC_GetFlagStatus(RCC_FLAG_PLL3RDY) == RESET)
//  {}
//
//  /* Get clock PLL3 clock on PA8 pin */
//  RCC_MCOConfig(RCC_MCO_PLL3CLK);
//	
//}

#if 0
extern void hal_brdcfg_switch__reg_write_byI2C(uint8_t* pBuffer, uint16_t WriteAddr)
{ 
    #define HAL_BRDCFG_I2C4HAL__PERIPHERAL I2C1

    /*!< While the bus is busy */
    while(I2C_GetFlagStatus(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_FLAG_BUSY))
    {
    }

    /*!< Send STRAT condition */
    I2C_GenerateSTART(HAL_BRDCFG_I2C4HAL__PERIPHERAL, ENABLE);
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_MODE_SELECT))
    {
    }  
    
    /*!< Send  address for write */
    I2C_Send7bitAddress(HAL_BRDCFG_I2C4HAL__PERIPHERAL, HAL_BRDCFG_ETH_I2C_ADDRESS_WRITE_OP, I2C_Direction_Transmitter);
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
    }
    
    //micrel phy register can be addressd by 8 bits.
    
    /*!< Send the physical's internal address to write */
    I2C_SendData(HAL_BRDCFG_I2C4HAL__PERIPHERAL, (uint8_t)(WriteAddr & 0x00FF));

    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
    {
    }
    
    /*!< Send the byte to be written */
    I2C_SendData(HAL_BRDCFG_I2C4HAL__PERIPHERAL, *pBuffer); 
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
    {
    }
    
    /*!< Send STOP condition */
    I2C_GenerateSTOP(HAL_BRDCFG_I2C4HAL__PERIPHERAL, ENABLE);

}


extern void hal_brdcfg_switch__reg_read_byI2C(uint8_t* pBuffer, uint16_t ReadAddr)
{
    #define HAL_BRDCFG_I2C4HAL__PERIPHERAL I2C1
    
    /*!< wait while the bus is busy */
    while(I2C_GetFlagStatus(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_FLAG_BUSY))
    {
    }
    /*!< Send STRAT condition */
    I2C_GenerateSTART(HAL_BRDCFG_I2C4HAL__PERIPHERAL, ENABLE);
 
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_MODE_SELECT))
    {
    }
    
    /*!< Send physical's address for read */
    I2C_Send7bitAddress(HAL_BRDCFG_I2C4HAL__PERIPHERAL, HAL_BRDCFG_ETH_I2C_ADDRESS_WRITE_OP, I2C_Direction_Transmitter);
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
    }
    
    
    ///micrel physical register can be addressd by 8 bits.
    /* Send the physical's internal address to read from: LSB of the address */
    I2C_SendData(HAL_BRDCFG_I2C4HAL__PERIPHERAL, (uint8_t)(ReadAddr & 0x00FF));    
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
    {
    }
    
    //I2C_AcknowledgeConfig(HAL_BRDCFG_I2C4HAL__PERIPHERAL, DISABLE);

    /* Send STRAT condition a second time */  
    I2C_GenerateSTART(HAL_BRDCFG_I2C4HAL__PERIPHERAL, ENABLE);
 
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_MODE_SELECT))
    {
    }

   
    /* Send physical address for read */
    I2C_Send7bitAddress(HAL_BRDCFG_I2C4HAL__PERIPHERAL, HAL_BRDCFG_ETH_I2C_ADDRESS_READ_OP, I2C_Direction_Receiver);
    
    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
    {
    }


    /* Enable Acknowledgement to be ready for another reception */
    I2C_AcknowledgeConfig(HAL_BRDCFG_I2C4HAL__PERIPHERAL, DISABLE);
    /* Send STOP Condition */
    I2C_GenerateSTOP(HAL_BRDCFG_I2C4HAL__PERIPHERAL, ENABLE);

    while(!I2C_CheckEvent(HAL_BRDCFG_I2C4HAL__PERIPHERAL, I2C_EVENT_MASTER_BYTE_RECEIVED))
    {
    }
    *pBuffer = I2C_ReceiveData(HAL_BRDCFG_I2C4HAL__PERIPHERAL);

